Revit 2024 API
InitialFluxIntensity Class
 This class encapsulates initial flux intensity calculation.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class InitialFluxIntensity : InitialIntensity
Visual Basic
Public Class InitialFluxIntensity _
	Inherits InitialIntensity
Visual C++
public ref class InitialFluxIntensity : public InitialIntensity
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialFluxIntensity
See Also
InitialFluxIntensity Members
Autodesk.Revit.DB.Lighting Namespace